about.html
---
layout: default
title: About
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfa328a9">About Me</a></li>
<li><a href="#org6f40680">About This Site</a></li>
<li><a href="#org8f905f2">Education</a>
<ul>
<li><a href="#org533493b">Utah State University</a></li>
<li><a href="#orgc3eddfb">Thomas Jefferson High School for Science and Technology</a></li>
</ul>
</li>
<li><a href="#org0d6088d">Work Experience</a>
<ul>
<li><a href="#org273283a">Junior Software Developer</a></li>
<li><a href="#orgb8ceb29">Senior Audiovisual Technician</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfa328a9" class="outline-2">
<h2 id="orgfa328a9">About Me</h2>
<div class="outline-text-2" id="text-orgfa328a9">
<p>
Hi, my name is Matthew Rothlisberger. I am an aspiring electrical
engineer and software developer.
</p>

<p>
I am passionate about engineering as a mechanism to improve our world;
I find it fulfilling to implement effective solutions for difficult
and meaningful problems. Whenever possible, I try to discover, learn,
and use the best tools available. My <a href="projects.html">projects</a> showcase some of my
work.
</p>
</div>
</div>

<div id="outline-container-org6f40680" class="outline-2">
<h2 id="org6f40680">About This Site</h2>
<div class="outline-text-2" id="text-org6f40680">
<p>
This site serves as a portfolio of my education, my work experience,
and of the engineering projects I have taken on over the
years. Sufficiently notable projects will be added and updated as I
make progress.
</p>

<p>
My <a href="blog.html">blog</a> is also hosted here. It is a place for me to write about
problems and solutions that interest me, primarily in the fields of
electrical engineering and software engineering. New posts will arrive
when I write them.
</p>

<p>
For more information on the technologies used to build this site,
consult the <a href="colophon.html">colophon</a>.
</p>
</div>
</div>

<div id="outline-container-org8f905f2" class="outline-2">
<h2 id="org8f905f2">Education</h2>
<div class="outline-text-2" id="text-org8f905f2">
<p>
To date, most recent to least recent:
</p>
</div>

<div id="outline-container-org533493b" class="outline-3">
<h3 id="org533493b">Utah State University</h3>
<div class="outline-text-3" id="text-org533493b">
<p>
<i>2021 - 2025</i>
</p>

<p>
<b>Admitted</b>
</p>

<p>
<b>B.S. Electrical Engineering</b>
</p>

<p>
I have been admitted to Utah State University for a bachelor of
science degree in electrical engineering. Because of the ongoing
pandemic, I chose to defer my admission and will be starting classes
around early 2021.
</p>
</div>
</div>

<div id="outline-container-orgc3eddfb" class="outline-3">
<h3 id="orgc3eddfb">Thomas Jefferson High School for Science and Technology</h3>
<div class="outline-text-3" id="text-orgc3eddfb">
<p>
<i>2016 - 2020</i>
</p>

<p>
<b>Graduated</b>
</p>

<p>
<b>Electrical Engineering Focus</b>
</p>

<p>
I attended TJHSST for ninth through twelfth grades after being
admitted through an extensive application process. The highlights of
my experience were the two years of hands on electrical engineering
classes I took. We began with analog circuit design and built up to
processor design, signal processing, and more.
</p>
</div>
</div>
</div>

<div id="outline-container-org0d6088d" class="outline-2">
<h2 id="org0d6088d">Work Experience</h2>
<div class="outline-text-2" id="text-org0d6088d">
<p>
Again, most to least recent:
</p>
</div>

<div id="outline-container-org273283a" class="outline-3">
<h3 id="org273283a">Junior Software Developer</h3>
<div class="outline-text-3" id="text-org273283a">
<p>
<i>2020 -</i>
</p>

<p>
<b>Freelance</b>
</p>

<p>
I am freelancing while seeking full time remote employment. During
this time, I am working on a variety of software projects using
languages and tools I am familiar with. Whenever I have time, I work
on open source and make an effort to learn valuable new engineering
skills.
</p>
</div>
</div>

<div id="outline-container-orgb8ceb29" class="outline-3">
<h3 id="orgb8ceb29">Senior Audiovisual Technician</h3>
<div class="outline-text-3" id="text-orgb8ceb29">
<p>
<i>2018 - 2020</i>
</p>

<p>
<b>Fairfax County Public Schools</b>
</p>

<p>
I was responsible for overseeing dozens of community events in an
auditorium that seats several hundred people. I developed proficiency
hanging and programming lighting fixtures; interfacing audio equipment
and equalizing signals; and working with customers of many cultures to
see their events through. I often worked under time pressure and under
unforeseen circumstances to ensure that events ran well.
</p>
</div>
</div>
</div>
